---
type: DuctFittingAndAccessoryConnectorData
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 13
tags: [revit-api, class]
---

# DuctFittingAndAccessoryConnectorData

`Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCoordination | 2017 | `public Transform GetCoordination ()` |
| Property | Angle | 2014 | `public double Angle { get ; }` |
| Property | Diameter | 2014 | `public double Diameter { get ; }` |
| Property | Flow | 2014 | `public double Flow { get ; }` |
| Property | FlowDirection | 2014 | `public FlowDirectionType FlowDirection { get ; }` |
| Property | Height | 2014 | `public double Height { get ; }` |
| Property | Index | 2014 | `public int Index { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LinkIndex | 2014 | `public int LinkIndex { get ; }` |
| Property | Profile | 2014 | `public ConnectorProfileType Profile { get ; }` |
| Property | VelocityPressure | 2014 | `public double VelocityPressure { get ; }` |
| Property | Width | 2014 | `public double Width { get ; }` |